<a href="https://colab.research.google.com/github/CheralaHarshini/Batch-11-12/blob/main/preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np
data = {
    "Name" : ["Alice","Bob","Charlie","david","Eve","Alice","charlie"],
    "Age" : [25,48,None,40,25,30,None],
    "City" : ["New York","London",None,"Paris","Berlin","New York",None],
    "Salary" : [50000,60000,None,80000,90000,50000,None]
}
df = pd.DataFrame(data)
print(df)

      Name   Age      City   Salary
0    Alice  25.0  New York  50000.0
1      Bob  48.0    London  60000.0
2  Charlie   NaN      None      NaN
3    david  40.0     Paris  80000.0
4      Eve  25.0    Berlin  90000.0
5    Alice  30.0  New York  50000.0
6  charlie   NaN      None      NaN

In [8]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['City'] = df['City'].fillna("Unknown")
df = df.dropna(subset = ['Salary'])

In [10]:
df = df.drop_duplicates()

In [11]:
df = df.rename(columns={"Name":"Employee Name","Age":"Employee Age"})

In [12]:
df['Employee Age'] = df['Employee Age'].astype(int)

In [14]:
df_filtered = df[df['Salary'] > 60000]

In [15]:
df['Bonus'] = df['Salary'] * 0.10

In [16]:
df = df.sort_values(by = 'Salary', ascending = False)

In [18]:
df_group = df.groupby('City')['Salary'].mean()
print(df_group)

City
Berlin      90000.0
London      60000.0
New York    50000.0
Paris       80000.0
Name: Salary, dtype: float64